## diff



<details>
<summary>Diff</summary>

```diff
--- a/examples/complete/plan-master.txt
+++ b/examples/complete/plan-pr.txt
@@ -1,4 +1,4 @@
-[command]/home/runner/work/_temp/057da085-9c71-46ce-a9fc-76a3fa119b9f/terraform-bin show -no-color tfplan-master
+[command]/home/runner/work/_temp/057da085-9c71-46ce-a9fc-76a3fa119b9f/terraform-bin show -no-color tfplan-pr
 
 Terraform used the selected providers to generate the following execution
 plan. Resource actions are indicated with the following symbols:
@@ -13,7 +13,7 @@ Terraform will perform the following actions:
       + daily_quota_gb                  = -1
       + id                              = (known after apply)
       + internet_ingestion_enabled      = true
-      + internet_query_enabled          = true
+      + internet_query_enabled          = false
       + local_authentication_disabled   = false
       + location                        = "northeurope"
       + name                            = "app-str-1-test-law"
@@ -69,6 +69,41 @@ Terraform will perform the following actions:
       + target_resource_id = (known after apply)
     }
 
+  # module.storage.azurerm_key_vault_key.kvkey[0] will be created
+  + resource "azurerm_key_vault_key" "kvkey" {
+      + curve                   = (known after apply)
+      + e                       = (known after apply)
+      + expiration_date         = "2034-10-22T18:29:59Z"
+      + id                      = (known after apply)
+      + key_opts                = [
+          + "decrypt",
+          + "encrypt",
+          + "sign",
+          + "unwrapKey",
+          + "verify",
+          + "wrapKey",
+        ]
+      + key_size                = 2048
+      + key_type                = "RSA"
+      + key_vault_id            = (known after apply)
+      + n                       = (known after apply)
+      + name                    = "app-str-1-test-storage-key-vault-key"
+      + public_key_openssh      = (known after apply)
+      + public_key_pem          = (known after apply)
+      + resource_id             = (known after apply)
+      + resource_versionless_id = (known after apply)
+      + tags                    = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Name"          = "app-str-1-test"
+          + "Repository"    = "https://github.com/clouddrove/terraform-azure-storage.git"
+        }
+      + version                 = (known after apply)
+      + versionless_id          = (known after apply)
+      + x                       = (known after apply)
+      + y                       = (known after apply)
+    }
+
   # module.storage.azurerm_private_dns_a_record.arecord[0] will be created
   + resource "azurerm_private_dns_a_record" "arecord" {
       + fqdn                = (known after apply)
@@ -149,6 +184,32 @@ Terraform will perform the following actions:
         }
     }
 
+  # module.storage.azurerm_role_assignment.identity_assigned[0] will be created
+  + resource "azurerm_role_assignment" "identity_assigned" {
+      + condition_version                = (known after apply)
+      + id                               = (known after apply)
+      + name                             = (known after apply)
+      + principal_id                     = (known after apply)
+      + principal_type                   = (known after apply)
+      + role_definition_id               = (known after apply)
+      + role_definition_name             = "Key Vault Crypto Service Encryption User"
+      + scope                            = (known after apply)
+      + skip_service_principal_aad_check = (known after apply)
+    }
+
+  # module.storage.azurerm_role_assignment.rbac_keyvault_crypto_officer["d346c9c7-0fb8-48ed-9c0f-9e048253dddc"] will be created
+  + resource "azurerm_role_assignment" "rbac_keyvault_crypto_officer" {
+      + condition_version                = (known after apply)
+      + id                               = (known after apply)
+      + name                             = (known after apply)
+      + principal_id                     = "d346c9c7-0fb8-48ed-9c0f-9e048253dddc"
+      + principal_type                   = (known after apply)
+      + role_definition_id               = (known after apply)
+      + role_definition_name             = "Key Vault Crypto Officer"
+      + scope                            = (known after apply)
+      + skip_service_principal_aad_check = (known after apply)
+    }
+
   # module.storage.azurerm_storage_account.storage[0] will be created
   + resource "azurerm_storage_account" "storage" {
       + access_tier                        = "Hot"
@@ -271,6 +332,18 @@ Terraform will perform the following actions:
             }
         }
 
+      + customer_managed_key {
+          + key_vault_key_id          = (known after apply)
+          + user_assigned_identity_id = (known after apply)
+        }
+
+      + identity {
+          + identity_ids = (known after apply)
+          + principal_id = (known after apply)
+          + tenant_id    = (known after apply)
+          + type         = "UserAssigned"
+        }
+
       + network_rules (known after apply)
 
       + queue_properties {
@@ -335,6 +408,23 @@ Terraform will perform the following actions:
       + storage_account_name = "storageq482"
     }
 
+  # module.storage.azurerm_user_assigned_identity.identity[0] will be created
+  + resource "azurerm_user_assigned_identity" "identity" {
+      + client_id           = (known after apply)
+      + id                  = (known after apply)
+      + location            = "northeurope"
+      + name                = "app-str-1-test-storage-mid"
+      + principal_id        = (known after apply)
+      + resource_group_name = "app-str-1-test-resource-group"
+      + tags                = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Name"          = "app-str-1-test"
+          + "Repository"    = "https://github.com/clouddrove/terraform-azure-storage.git"
+        }
+      + tenant_id           = (known after apply)
+    }
+
   # module.subnet.azurerm_route_table.rt[0] will be created
   + resource "azurerm_route_table" "rt" {
       + bgp_route_propagation_enabled = true
@@ -377,6 +467,17 @@ Terraform will perform the following actions:
       + subnet_id      = (known after apply)
     }
 
+  # module.vault.data.azurerm_private_endpoint_connection.private-ip[0] will be read during apply
+  # (depends on a resource or a module with changes pending)
+ <= data "azurerm_private_endpoint_connection" "private-ip" {
+      + id                         = (known after apply)
+      + location                   = (known after apply)
+      + name                       = "vae5960581-test-pe-kv"
+      + network_interface          = (known after apply)
+      + private_service_connection = (known after apply)
+      + resource_group_name        = "app-str-1-test-resource-group"
+    }
+
   # module.vault.azurerm_key_vault.key_vault[0] will be created
   + resource "azurerm_key_vault" "key_vault" {
       + access_policy                   = (known after apply)
@@ -424,6 +525,96 @@ Terraform will perform the following actions:
         }
     }
 
+  # module.vault.azurerm_monitor_diagnostic_setting.pe_kv_nic[0] will be created
+  + resource "azurerm_monitor_diagnostic_setting" "pe_kv_nic" {
+      + id                             = (known after apply)
+      + log_analytics_destination_type = "AzureDiagnostics"
+      + log_analytics_workspace_id     = (known after apply)
+      + name                           = "vae5960581-test-pe-kv-nic-diagnostic-log"
+      + target_resource_id             = (known after apply)
+
+      + metric {
+          + category = "AllMetrics"
+          + enabled  = true
+        }
+    }
+
+  # module.vault.azurerm_private_dns_a_record.arecord[0] will be created
+  + resource "azurerm_private_dns_a_record" "arecord" {
+      + fqdn                = (known after apply)
+      + id                  = (known after apply)
+      + name                = "vae5960581-test-kv"
+      + records             = (known after apply)
+      + resource_group_name = "app-str-1-test-resource-group"
+      + tags                = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Name"          = "vae5960581-test"
+        }
+      + ttl                 = 3600
+      + zone_name           = "privatelink.vaultcore.azure.net"
+    }
+
+  # module.vault.azurerm_private_dns_zone.dnszone[0] will be created
+  + resource "azurerm_private_dns_zone" "dnszone" {
+      + id                                                    = (known after apply)
+      + max_number_of_record_sets                             = (known after apply)
+      + max_number_of_virtual_network_links                   = (known after apply)
+      + max_number_of_virtual_network_links_with_registration = (known after apply)
+      + name                                                  = "privatelink.vaultcore.azure.net"
+      + number_of_record_sets                                 = (known after apply)
+      + resource_group_name                                   = "app-str-1-test-resource-group"
+      + tags                                                  = {
+          + "Business_unit" = "corp"
+          + "Environment"   = "test"
+          + "Name"          = "vae5960581-test"
+        }
+
+      + soa_record (known after apply)
+    }
+
+  # module.vault.azurerm_private_dns_zone_virtual_network_link.vent-link[0] will be created
+  + resource "azurerm_private_dns_zone_virtual_network_link" "vent-link" {
+      + id                    = (known after apply)
+      + name                  = "vae5960581-test-pdz-vnet-link-kv"
+      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
+      + registration_enabled  = false
+      + resource_group_name   = "app-str-1-test-resource-group"
+      + tags                  = {
+          + "Business_unit" = "corp"
+          + "Environment"   = 
```
See the full diff from https://github.com/ravimalvia10/terraform-azure-dummy/actions/runs/14665086632

</details>

[GitHub Actions](https://github.com/ravimalvia10/terraform-azure-dummy/actions/runs/14665086632)

<!-- diff-action -->
<!-- diff-action/Terraform Plan PR Diff/terraform-plan -->